# Домашнее задание 1 (5 баллов).

Все задания ниже имеют равный вес (5/16).

In [1]:
import pandas as pd

#### Описание данных

В папке Data находится информация о студентах. Всего 10 групп студентов. Файлы делятся на две категории:
    * Students_info_i - информация о студентах из группы i
    * Students_marks_i - оценки студентов из группы i за экзамены

### Одно из важных достоинств pandas $-$ это удобные методы реляционного взаимодействия с данными, аналогичные, например, возможностям SQL для слияния и конкатенации таблиц: merge, join, concat. Наличие готовых методов позволяет не реализовывать самостоятельно поэлементную обработку данных и оперировать сразу целыми таблицами данных.

Подробно об этих методах посмотрите тут: https://www.kaggle.com/residentmario/renaming-and-combining#Combining

#### Задание 1. Соберите всю информацию о студентах в одну таблицу df. В получившейся таблице должна быть информация и оценки всех студентов из всех групп. Напечатайте несколько строк таблицы для демонстрации результата.¶

In [19]:
#your code here
df0 = pd.read_csv('Students_info_0.csv')
df1 = pd.read_csv('Students_info_1.csv')
df2 = pd.read_csv('Students_info_2.csv')
df3 = pd.read_csv('Students_info_3.csv')
df4 = pd.read_csv('Students_info_4.csv')
df5 = pd.read_csv('Students_info_5.csv')
df6 = pd.read_csv('Students_info_6.csv')
df7 = pd.read_csv('Students_info_7.csv')
df8 = pd.read_csv('Students_info_8.csv')
df9 = pd.read_csv('Students_info_9.csv')

In [20]:
df = pd.concat([df0, df1, df2, df3, df4, df5, df6, df7, df8, df9]) 
df.shape

(1000, 7)

In [13]:
df.head()

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,group
0,0,female,group B,bachelor's degree,standard,none,group1
1,1,female,group C,some college,standard,completed,group1
2,2,female,group B,master's degree,standard,none,group1
3,3,male,group A,associate's degree,free/reduced,none,group1
4,4,male,group C,some college,standard,none,group1

In [21]:
df00 = pd.read_csv('Students_marks_0.csv')
df01 = pd.read_csv('Students_marks_1.csv')
df02 = pd.read_csv('Students_marks_2.csv')
df03 = pd.read_csv('Students_marks_3.csv')
df04 = pd.read_csv('Students_marks_4.csv')
df05 = pd.read_csv('Students_marks_5.csv')
df06 = pd.read_csv('Students_marks_6.csv')
df07 = pd.read_csv('Students_marks_7.csv')
df08 = pd.read_csv('Students_marks_8.csv')
df09 = pd.read_csv('Students_marks_9.csv')

df_new = pd.concat([df00, df01, df02, df03, df04, df05, df06, df07, df08, df09]) 
df_new.shape

(1000, 4)

In [30]:
df00.head()

   index  math score  reading score  writing score
0      0          72             72             74
1      1          69             90             88
2      2          90             95             93
3      3          47             57             44
4      4          76             78             75

In [31]:
df_new.head()

   index  math score  reading score  writing score
0      0          72             72             74
1      1          69             90             88
2      2          90             95             93
3      3          47             57             44
4      4          76             78             75

In [63]:
df_full = pd.concat([df_new, df], axis=1, join='outer')
df_full.shape

(1000, 11)

In [64]:
df_full.head()

,index,math score,reading score,writing score,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,group
0,0,72,72,74,0,female,group B,bachelor's degree,standard,none,group1
1,1,69,90,88,1,female,group C,some college,standard,completed,group1
2,2,90,95,93,2,female,group B,master's degree,standard,none,group1
3,3,47,57,44,3,male,group A,associate's degree,free/reduced,none,group1
4,4,76,78,75,4,male,group C,some college,standard,none,group1

#### Задание 2. Удалите столбец index у полученной таблицы. Напечатайте первые 10 строк таблицы.

In [37]:
#your code here
df_full.drop('index', axis=1, inplace=True)

In [39]:
df_full.head(10)

,math score,reading score,writing score,gender,race/ethnicity,parental level of education,lunch,test preparation course,group
0,72,72,74,female,group B,bachelor's degree,standard,none,group1
1,69,90,88,female,group C,some college,standard,completed,group1
2,90,95,93,female,group B,master's degree,standard,none,group1
3,47,57,44,male,group A,associate's degree,free/reduced,none,group1
4,76,78,75,male,group C,some college,standard,none,group1
5,71,83,78,female,group B,associate's degree,standard,none,group1
6,88,95,92,female,group B,some college,standard,completed,group1
7,40,43,39,male,group B,some college,free/reduced,none,group1
8,64,64,67,male,group D,high school,free/reduced,completed,group1
9,38,60,50,female,group B,high school,free/reduced,none,group1

#### Задание 3. Выведите на экран размеры полученной таблицы

In [40]:
# your code here
df_full.shape

(1000, 9)

#### Задание 4. Выведите на экран статистические характеристики числовых столбцов таблицы (минимум, максимум, среднее значение, стандартное отклонение)

In [41]:
# your code here
df_full.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

#### Задание 5. Проверьте, есть ли в таблице пропущенные значения

In [42]:
# your code here
df_full.isnull().sum()

math score                     0
reading score                  0
writing score                  0
gender                         0
race/ethnicity                 0
parental level of education    0
lunch                          0
test preparation course        0
group                          0
dtype: int64

#### Задание 6. Выведите на экран средние баллы студентов по каждому предмету (math, reading, writing)

In [43]:
# your code here
df_full.mean()

C:\Users\julia_krav\AppData\Local\Temp\ipykernel_17220\1225435744.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df_full.mean()

math score       66.089
reading score    69.169
writing score    68.054
dtype: float64

**Задание 7. Как зависят оценки от того, проходил ли студент курс для подготовки к сдаче экзамена (test preparation course)? Выведите на экран для каждого предмета в отдельности средний балл студентов, проходивших курс для подготовки к экзамену и не проходивших курс.**

In [46]:
# your code here
df_full['math score'][(df_full['test preparation course'] == 'completed')].mean()

69.69553072625699

In [47]:
df_full['math score'][(df_full['test preparation course'] != 'completed')].mean()

64.0778816199377

In [48]:
df_full['reading score'][(df_full['test preparation course'] == 'completed')].mean()

73.89385474860335

In [49]:
df_full['reading score'][(df_full['test preparation course'] != 'completed')].mean()

66.53426791277259

In [50]:
df_full['writing score'][(df_full['test preparation course'] == 'completed')].mean()

74.41899441340782

In [51]:
df_full['writing score'][(df_full['test preparation course'] != 'completed')].mean()

64.50467289719626

**Задание 8. Выведите на экран все различные значения из столбца lunch.**

In [52]:
# your code here
df_full['lunch'].unique()

array(['standard', 'free/reduced'], dtype=object)

**Задание 9. Переименуйте колонку "parental level of education" в "education", а "test preparation course" в "test preparation" с помощью метода pandas rename**
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html

In [78]:
# your code here
df_full.rename(columns={"parental level of education": "education", "test preparation course": "test preparation"}, inplace=True)

In [79]:
df_full.columns

Index(['index', 'math score', 'reading score', 'writing score', 'index',
       'gender', 'race/ethnicity', 'education', 'lunch', 'test preparation',
       'group'],
      dtype='object')

**Зафиксируем минимальный балл для сдачи экзамена**

In [62]:
passmark = 50

**Задание 10. Ответьте на вопросы:**
    * Какая доля студентов сдала экзамен по математике (passmark >= 50)?
    * Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?
    * Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?

In [71]:
# your code here
df_full['math score'][(df_full['math score'] >= passmark)].count()/df.shape[0]

0.865

In [72]:
df_full['math score'][(df_full['test preparation course'] == 'completed')&(df_full['math score'] >= passmark)].count()/df.shape[0]

0.33

In [73]:
df_full['math score'][(df_full['gender'] == 'female')&(df_full['test preparation course'] != 'completed')&(df_full['math score'] < passmark)].count()/df.shape[0]

0.07

**Задание 11. С помощью groupby выполните задания ниже. Также выведите время выполнения каждого из заданий.**
    * Для каждой этнической группы выведите средний балл за экзамен по чтению
    * Для каждого уровня образования выведите минимальный балл за экзамен по письму

In [74]:
# your code here
df_full['race/ethnicity'].unique()

array(['group B', 'group C', 'group A', 'group D', 'group E'],
      dtype=object)

In [76]:
%%time
df_full.groupby('race/ethnicity')['reading score'].mean()

Wall time: 3 ms

race/ethnicity
group A    64.674157
group B    67.352632
group C    69.103448
group D    70.030534
group E    73.028571
Name: reading score, dtype: float64

In [80]:
df_full['education'].unique()

array(["bachelor's degree", 'some college', "master's degree",
       "associate's degree", 'high school', 'some high school'],
      dtype=object)

In [82]:
%%time
df_full.groupby('education')['writing score'].min()

Wall time: 3 ms

education
associate's degree    35
bachelor's degree     38
high school           15
master's degree       46
some college          19
some high school      10
Name: writing score, dtype: int64

**Задание 12. Выполните задание 11 с помощью циклов. Сравните время выполнения.**

In [90]:
# your code here
# it will be slow, don't waste time figuring out

**Задание 13. Выведите на экран средние баллы студентов по каждому предмету в зависимости от пола и уровня образования. То есть должно получиться количество групп, равных 2 * (число уровней образования), и для каждой такой группы выыведите средний балл по каждому из предметов.**

Это можно сделать с помощью сводных таблиц (pivot_table):

https://www.kaggle.com/kamilpolak/tutorial-how-to-use-pivot-table-in-pandas

In [92]:
# your code here
df_full.columns

Index(['index', 'math score', 'reading score', 'writing score', 'index',
       'gender', 'race/ethnicity', 'education', 'lunch', 'test preparation',
       'group'],
      dtype='object')

In [101]:
grouped = pd.pivot_table(df_full,index=['gender', 'education'])
grouped

                                index       index  math score  reading score  \
gender education
female associate's degree  496.715517  496.715517   65.250000      74.120690
       bachelor's degree   500.793651  500.793651   68.349206      77.285714
       high school         567.457447  567.457447   59.351064      68.202128
       master's degree     462.666667  462.666667   66.500000      76.805556
       some college        495.550847  495.550847   65.406780      73.550847
       some high school    519.868132  519.868132   59.296703      69.109890
male   associate's degree  446.575472  446.575472   70.764151      67.433962
       bachelor's degree   498.327273  498.327273   70.581818      68.090909
       high school         515.382353  515.382353   64.705882      61.480392
       master's degree     504.652174  504.652174   74.826087      73.130435
       some college        489.638889  489.638889   69.009259      64.990741
       some high school    485.784091  485.784091   67.840909      64.693182

                           writing score
gender education
female associate's degree      74.000000
       bachelor's degree       78.380952
       high school             66.691489
       master's degree         77.638889
       some college            74.050847
       some high school        68.285714
male   associate's degree      65.405660
       bachelor's degree       67.654545
       high school             58.539216
       master's degree         72.608696
       some college            63.148148
       some high school        61.375000

In [100]:
df_full['math score'][(df_full['gender'] == 'female')].mean()

63.633204633204635

#### Задание 14. Сколько студентов успешно сдали экзамен по математике?

Создайте новый столбец в таблице df под названием Math_PassStatus и запишите в него F, если студент не сдал экзамен по математике (балл за экзамен < passmark), и P иначе.

Посчитайте количество студентов, сдавших и не сдавших экзамен по математике.

Сделайте аналогичные шаги для экзаменов по чтению и письму.

In [107]:
df_full['Math_PassStatus'] = df_full['math score'] >= passmark

0      True
1      True
2      True
3     False
4      True
      ...
95     True
96     True
97     True
98     True
99     True
Name: Math_PassStatus, Length: 1000, dtype: bool

In [109]:
df_full['Math_PassStatus'] = df_full['Math_PassStatus'].map({True: 'P', False: 'F'})
df_full['Math_PassStatus'].head()

0    P
1    P
2    P
3    F
4    P
Name: Math_PassStatus, dtype: object

In [123]:
df_full['Math_PassStatus'].value_counts()[1]

135

In [117]:
df_full[(df_full['Math_PassStatus'] == 'F')].count()

index               135
math score          135
reading score       135
writing score       135
index               135
gender              135
race/ethnicity      135
education           135
lunch               135
test preparation    135
group               135
Math_PassStatus     135
dtype: int64

In [128]:
df_full['Reading_PassStatus'] = df_full['reading score'] >= passmark
df_full['Reading_PassStatus']

0     True
1     True
2     True
3     True
4     True
      ...
95    True
96    True
97    True
98    True
99    True
Name: Reading_PassStatus, Length: 1000, dtype: bool

In [129]:
df_full['Reading_PassStatus'] = df_full['Reading_PassStatus'].map({True: 'P', False: 'F'})
df_full['Reading_PassStatus'].head()

0    P
1    P
2    P
3    P
4    P
Name: Reading_PassStatus, dtype: object

In [130]:
df_full[(df_full['Reading_PassStatus'] == 'F')].count()

index                 90
math score            90
reading score         90
writing score         90
index                 90
gender                90
race/ethnicity        90
education             90
lunch                 90
test preparation      90
group                 90
Math_PassStatus       90
Reading_PassStatus    90
dtype: int64

In [132]:
df_full['Reading_PassStatus'].value_counts()[1]

90

In [133]:
df_full['Writing_PassStatus'] = df_full['writing score'] >= passmark
df_full['Writing_PassStatus']

0      True
1      True
2      True
3     False
4      True
      ...
95     True
96     True
97     True
98     True
99     True
Name: Writing_PassStatus, Length: 1000, dtype: bool

In [134]:
df_full['Writing_PassStatus'] = df_full['Writing_PassStatus'].map({True: 'P', False: 'F'})
df_full['Writing_PassStatus'].head()

0    P
1    P
2    P
3    F
4    P
Name: Writing_PassStatus, dtype: object

In [137]:
df_full['Writing_PassStatus'].value_counts()[1]

114

In [141]:
df_full['Writing_PassStatus'].unique()

array(['P', 'F'], dtype=object)

#### Задание 15. Сколько студентов успешно сдали все экзамены?

Создайте столбец OverAll_PassStatus и запишите в него для каждого студента 'F', если студент не сдал хотя бы один из трех экзаменов, а иначе 'P'.

Посчитайте количество студентов, которые сдали все экзамены.

In [156]:
df_full[(df_full['Writing_PassStatus'] == 'P') & (df_full['Reading_PassStatus'] == 'P') & (df_full['Math_PassStatus'] == 'P')]

,index,math score,reading score,writing score,index,gender,race/ethnicity,education,lunch,test preparation,group,Math_PassStatus,Reading_PassStatus,Writing_PassStatus
0,0,72,72,74,0,female,group B,bachelor's degree,standard,none,group1,P,P,P
1,1,69,90,88,1,female,group C,some college,standard,completed,group1,P,P,P
2,2,90,95,93,2,female,group B,master's degree,standard,none,group1,P,P,P
4,4,76,78,75,4,male,group C,some college,standard,none,group1,P,P,P
5,5,71,83,78,5,female,group B,associate's degree,standard,none,group1,P,P,P
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,995,88,99,95,995,female,group E,master's degree,standard,completed,group10,P,P,P
96,996,62,55,55,996,male,group C,high school,free/reduced,none,group10,P,P,P
97,997,59,71,65,997,female,group C,high school,free/reduced,completed,group10,P,P,P
98,998,68,78,77,998,female,group D,some college,standard,completed,group10,P,P,P
99,999,77,86,86,999,female,group D,some college,free/reduced,none,group10,P,P,P

In [167]:
df_full['OverAll_PassStatus'] = (df_full['reading score'] < passmark) | (df_full['math score'] < passmark) | (df_full['writing score'] < passmark)
df_full['OverAll_PassStatus'] = df_full['OverAll_PassStatus'].map({True: 'F', False: 'T'})
df_full['OverAll_PassStatus'][(df_full['OverAll_PassStatus']=='T')].count()

812

In [168]:
df_full.head()

,index,math score,reading score,writing score,index,gender,race/ethnicity,education,lunch,test preparation,group,Math_PassStatus,Reading_PassStatus,Writing_PassStatus,OverAll_PassStatus,OverAll_PassStatus
0,0,72,72,74,0,female,group B,bachelor's degree,standard,none,group1,P,P,P,False,T
1,1,69,90,88,1,female,group C,some college,standard,completed,group1,P,P,P,False,T
2,2,90,95,93,2,female,group B,master's degree,standard,none,group1,P,P,P,False,T
3,3,47,57,44,3,male,group A,associate's degree,free/reduced,none,group1,F,P,F,True,F
4,4,76,78,75,4,male,group C,some college,standard,none,group1,P,P,P,False,T

#### Задание 16. Переведем баллы в оценки

### Система перевода баллов в оценки
####    больше 90 = A
####      80-90 = B
####      70-80 = C
####      60-70 = D
####      50-60 = E
####    меньше 50 = F (Fail)

Создайте вспомогательную функцию, которая будет по среднему баллу за три экзамена выставлять оценку студенту по данным выше критериям.

Создайте столбец Grade и запишите в него оценку каждого студента.

Выведите количество студентов, получивших каждую из оценок.

**В случае, если средний балл попадает на границу между оценками (т.е. равен ровно 60, 70 или 80 баллов), вы можете интерпретировать условие на своё усмотрение (т.е. можете поставить за 60 баллов оценку D, а можете - E).**

In [223]:
def GetGrade(average_mark):
    if average_mark >= 90.0:
        df_full['Grade'] = 'A'
    elif average_mark >= 80:
        df_full['Grade'] == 'B'
    elif average_mark >= 70:
        df_full['Grade'] == 'C'
    elif average_mark >= 60:
        df_full['Grade'] == 'D'
    elif average_mark >= 50:
        df_full['Grade'] == 'E'
    else: 
        df_full['Grade'] = 'F'

In [212]:
average_mark = df_full['grade']
df_full['Grade'] = df_full['grade'].apply(GetGrade)
df_full

,index,math score,reading score,writing score,index,gender,race/ethnicity,education,lunch,test preparation,group,Math_PassStatus,Reading_PassStatus,Writing_PassStatus,OverAll_PassStatus,OverAll_PassStatus,Grade,grade
0,0,72,72,74,0,female,group B,bachelor's degree,standard,none,group1,P,P,P,False,T,None,73.0
1,1,69,90,88,1,female,group C,some college,standard,completed,group1,P,P,P,False,T,None,82.0
2,2,90,95,93,2,female,group B,master's degree,standard,none,group1,P,P,P,False,T,None,93.0
3,3,47,57,44,3,male,group A,associate's degree,free/reduced,none,group1,F,P,F,True,F,None,49.0
4,4,76,78,75,4,male,group C,some college,standard,none,group1,P,P,P,False,T,None,76.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,995,88,99,95,995,female,group E,master's degree,standard,completed,group10,P,P,P,False,T,None,94.0
96,996,62,55,55,996,male,group C,high school,free/reduced,none,group10,P,P,P,False,T,None,57.0
97,997,59,71,65,997,female,group C,high school,free/reduced,completed,group10,P,P,P,False,T,None,65.0
98,998,68,78,77,998,female,group D,some college,standard,completed,group10,P,P,P,False,T,None,74.0
99,999,77,86,86,999,female,group D,some college,free/reduced,none,group10,P,P,P,False,T,None,83.0

In [215]:
df_full['grade'].astype(float)

0     73.0
1     82.0
2     93.0
3     49.0
4     76.0
      ...
95    94.0
96    57.0
97    65.0
98    74.0
99    83.0
Name: grade, Length: 1000, dtype: float64

In [214]:
df_full['grade'] = round(df_full[['math score', 'writing score', 'reading score']].mean(axis=1), 0)
df_full

,index,math score,reading score,writing score,index,gender,race/ethnicity,education,lunch,test preparation,group,Math_PassStatus,Reading_PassStatus,Writing_PassStatus,OverAll_PassStatus,OverAll_PassStatus,Grade,grade
0,0,72,72,74,0,female,group B,bachelor's degree,standard,none,group1,P,P,P,False,T,None,73.0
1,1,69,90,88,1,female,group C,some college,standard,completed,group1,P,P,P,False,T,None,82.0
2,2,90,95,93,2,female,group B,master's degree,standard,none,group1,P,P,P,False,T,None,93.0
3,3,47,57,44,3,male,group A,associate's degree,free/reduced,none,group1,F,P,F,True,F,None,49.0
4,4,76,78,75,4,male,group C,some college,standard,none,group1,P,P,P,False,T,None,76.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,995,88,99,95,995,female,group E,master's degree,standard,completed,group10,P,P,P,False,T,None,94.0
96,996,62,55,55,996,male,group C,high school,free/reduced,none,group10,P,P,P,False,T,None,57.0
97,997,59,71,65,997,female,group C,high school,free/reduced,completed,group10,P,P,P,False,T,None,65.0
98,998,68,78,77,998,female,group D,some college,standard,completed,group10,P,P,P,False,T,None,74.0
99,999,77,86,86,999,female,group D,some college,free/reduced,none,group10,P,P,P,False,T,None,83.0

In [224]:
# instead of applying a `func` to each row of a column, use `numpy.select` as below
import numpy as np
conditions = [df_full['grade'] >= 90.0, df_full['grade'] >= 80.0, df_full['grade'] >= 70.0,
             df_full['grade'] >= 60.0, df_full['grade'] >= 50.0]
choices = ['A', 'B', 'C', 'D', 'E']
df_full['Grade'] = np.select(conditions, choices, default='F')

In [225]:
df_full['Grade']

0     C
1     B
2     A
3     F
4     C
     ..
95    A
96    E
97    D
98    C
99    B
Name: Grade, Length: 1000, dtype: object

In [229]:
df_full['Grade'].value_counts()

C    258
D    256
E    180
B    152
F    100
A     54
Name: Grade, dtype: int64